import { MainLayout } from 'widgets/layouts'

import { Flex, Typography } from 'shared/ui/components'

import * as S from './styles'

export const AnswersPage = () => {
  return (
    <MainLayout>
      <S.APContainer>
        <Flex
          flexDirection='column'
          justifyContent='center'
          gap='6.4rem'
          padding='3.2rem 0'
        >
          <Typography variant='t_40_extraBold'>Вопросы от подростков</Typography>
          <Flex flexDirection='column' gap='6rem'>
            <Flex flexDirection='column' gap='4rem'>
              <Flex flexDirection='column' gap='2rem'>
                <Typography variant='t_32_extraBold'>Блок 1</Typography>
                <Typography variant='t_20_semiBold'>
                  Представь, что в общем чате со учениками-подростками ты видишь следующие
                  сообщения. Пожалуйста, сформулируй и напиши ответ на каждое из них (не
                  более 400 знаков каждое)
                </Typography>
              </Flex>
              <Flex flexDirection='column' gap='3.2rem'>
                <Flex flexDirection='column' gap='1.6rem'>
                  <Typography variant='t_16_semiBold'>
                    1. Этот курс совсем для новичков, он таким до конца и будет или мы
                    будем делать что-то поинтереснее?
                  </Typography>
                  <Typography variant='t_15_regular'>
                    Здравствуйте, данный курс рассчитан в первую очередь на студентов с
                    разным уровнем знаний и по началу более подготовленным может
                    показаться, что курс слишком прост для них, но можете не переживать, в
                    течении всего курса вы все сровняетесь, а темы и задания станут
                    сложнее и интереснее. Так же как говорил древнеримский поэт Овидий:
                    “Повторение – мать учения”.
                  </Typography>
                </Flex>
                <Flex flexDirection='column' gap='1.6rem'>
                  <Typography variant='t_16_semiBold'>
                    2. Я ничего не успеваю, успел только один урок посмотреть, а на
                    практику времени не хватает(((
                  </Typography>
                  <Typography variant='t_15_regular'>
                    Здравствуйте, ничего страшного, в течении курса всегда можно нагнать
                    нужный темп, если в будние дни времени совсем не хватает, всегда есть
                    выходные, но если проблема в сложности понимания материала, то не
                    стесняйтесь и задавайте абсолютно любые вопросы сюда же, другие ребята
                    или я всегда будут рады вам помочь, если есть прямо сейчас что
                    спросить, давайте, вместе мы сила 💪
                  </Typography>
                </Flex>
                <Flex flexDirection='column' gap='1.6rem'>
                  <Typography variant='t_16_semiBold'>
                    3. Я пропустила вебинар и теперь ничего вообще не понимаю, что
                    происходит
                  </Typography>
                  <Typography variant='t_15_regular'>
                    Здравствуйте, вебинары всегда остаются в записи и вы можете с
                    легкостью посмотреть их, то что вы чего-то не понимаете это абсолютно
                    нормально, главное не затягивать и не усугублять, если во время
                    просмотра будут вопросы, обязательно задавайте их сюда же и вы всегда
                    получите на них ответы.
                  </Typography>
                </Flex>
                <Flex flexDirection='column' gap='1.6rem'>
                  <Typography variant='t_16_semiBold'>
                    4. Вот на этой странице на платформе /скрин/ 3я картинка ну вообще не
                    к месту( Да и вообще дизайн странноватый…
                  </Typography>
                  <Typography variant='t_15_regular'>
                    Здравствуйте, мы постоянно совершенствуемся и обновляем наши курсы, в
                    том числе благодаря нашим студентам, спасибо что обратили внимание и
                    если бы вы поделились, а что именно не так, какой дизайн подошел бы
                    лучше, это бы было совсем здорово и помогло бы сделать наш продукт еще
                    ну чуточку лучше для всех.
                  </Typography>
                </Flex>
              </Flex>
            </Flex>
            <Flex flexDirection='column' gap='4rem'>
              <Flex flexDirection='column' gap='2rem'>
                <Typography variant='t_32_extraBold'>Блок 2</Typography>
                <Typography variant='t_20_semiBold'>
                  Придумай 3 идеи, как ты, как наставник, можешь поддерживать и
                  стимулировать общение в чате учебной группы подростков в промежутке
                  между занятиями-созвонами, которые происходят у вас 2 раза в неделю.
                </Typography>
              </Flex>
              <Flex flexDirection='column' gap='1.6rem'>
                <Typography variant='t_16_semiBold'>Идея №1</Typography>
                <Typography variant='t_15_regular'>
                  Периодически бы напоминал и объяснял, что этот чат в первую очередь
                  существует, чтобы было место где можно задать любой вопрос и получить на
                  него ответ, чем больше вопросов, тем быстрее прейдет понимание, плюс
                  вопрос одного может помочь большинству, возможно бы даже собрал созвон,
                  где рассказал бы свой путь того как я начинал задавать схожие вопросы на
                  форумах, о важности этого процесса и как им в итоге это поможет
                </Typography>
              </Flex>
              <Flex flexDirection='column' gap='1.6rem'>
                <Typography variant='t_16_semiBold'>Идея №2</Typography>
                <Typography variant='t_15_regular'>
                  Периодически бы закидывал в чат интересные видео, статьи для
                  дополнительного изучения, а так же бы предлагал студентам делать тоже
                  самое
                </Typography>
              </Flex>
              <Flex flexDirection='column' gap='1.6rem'>
                <Typography variant='t_16_semiBold'>Идея №3</Typography>
                <Typography variant='t_15_regular'>
                  Для общего понимания будущего развития студентов, скидывал бы
                  потенциальные вакансии на которые я смогут откликаться в ближайшем
                  будущем и рассказывал какие бывают собеседования, что их может на них
                  ждать, какие бывают проекты в разных компаниях и что обычно приходится
                  делать стандартному разработчику
                </Typography>
              </Flex>
            </Flex>
            <Flex flexDirection='column' gap='4rem'>
              <Flex flexDirection='column' gap='2rem'>
                <Typography variant='t_32_extraBold'>Блок 3</Typography>
                <Typography variant='t_20_semiBold'>
                  Написание мотивирующего поста в группе с учениками. <br /> <br /> Ты
                  несколько раз напоминал/а ученикам о дедлайне по практическому заданию.
                  Срок сдачи заданий подходит уже сегодня, но только 30% группы прислали
                  задания, а 70% ребят никак не отреагировали. Напиши, пожалуйста,
                  мотивирующий пост в общий чат, который побудит остальных учеников сдать
                  работу вовремя.
                </Typography>
              </Flex>
              <Typography variant='t_15_regular'>
                Ребят, я как и вы был в самом начале пути, помню как часто опускались
                руки, казалось что я зря все это начал и у меня ничего не получится и что
                всегда будет кто-то лучше меня, но раз за разом, когда у меня мелкими
                шажочками что-то получалось я начинал чувствовать, что нет ничего
                невозможного, однажды я понял 3 вещи, первое, то что я уже все это начал,
                говорит обо мне как о человеке готовым выйти из зоны комфорта и те
                трудности с которыми я сталкиваюсь раз за разом и в итоге решаю их, лишнее
                тому подтверждение и второе я понял чтобы чего-то добиться в IT, нужно
                задавать вопросы, много вопросов, даже когда кажется что я слабее всех и
                мне стыдно что-то спрашивать, все равно спрашивайте, каждый полученный
                ответ сделает вас сильнее и третье, те кто отвечают на ваши вопросы, точно
                так же задавали их сами. По этому чтобы добиться той цели которую вы
                поставили, прийдя на эти курсы, вам нужно не молчать, я здесь для того
                чтобы помочь справиться с любыми вашими трудностями, ведь когда-то и я был
                на вашем месте и мне так же помогли и помогали на протяжении всей моей
                карьеры и продолжают помогать и по сей день, по этому овладев этим
                навыком, вас ничего не остановит, вместе мы сила 💪
              </Typography>
            </Flex>
          </Flex>
        </Flex>
      </S.APContainer>
    </MainLayout>
  )
}
